Abear6666/stm32lock/code/stm32code/Hardware/RC522.c
#include "stm32f10x.h"
#include "rc522.h"
#include "delay.h"
#include "spi_driver.h"
#include "stm32f10x_spi.h"
#include "usart.h"
#include "Servo.h"
#include "led.h"
#include "oled.h"
#include "servo.h"
#include "Flash.h"
#include "key.h"
#include <stdio.h>
#include <string.h>
#include "onenet.h"
#include "esp8266.h"


uint8_t UI0[4]={0xFF,0xFF,0xFF,0xFF};		 	//卡0ID号
uint8_t UI1[4]={0xFF,0xFF,0xFF,0xFF};	 		//卡1ID号
uint8_t UI2[4]={0xFF,0xFF,0xFF,0xFF};			//卡2ID号
uint8_t UI3[4]={0xFF,0xFF,0xFF,0xFF};			//卡3ID号

uint8_t UID[4],Temp[4];
uint8_t tempcard;
extern u8 Fail_Num; // 门禁解锁错误次数

extern void unlock_interface(void);  //解锁界面

extern const char *devSubTopic[];
extern const char devPubTopic[];


/******************************************************************************


硬件连接
STM32F103C8T6       RC522模块
PA4（SPI1_NSS）      	SDA
PA5（SPI1_SCK）				SCK
PA6（SPI1_MISO）			MISO
PA7（SPI1_MOSI）			MOSI
PA11（RST）						RST0
PB1（IRQ）						IRQ  未定义

呼吸灯 B6
继电器 A12 

USART1_TX   GPIOA.9

USART1_RX   GPIOA.10

功能有识别读卡，解锁，防死机
读卡用的是RC522 执行机构是舵机，陪有蜂鸣器，和继电器。继电器只在舵机动作之前接通为舵机供电，其余时间舵机为断电状态
有呼吸灯的功能，在正常运行时呼吸提示作用，错误到达6次后，呼吸灯熄灭，表示机器已锁定，等待重启即可灰度
定时器看门狗会每两个小时重启复位一次。思路是定时器定时两小时，启用看门狗但是不喂狗
重要，卡录入方法！！！
将线接好后，刷卡，观察串口1有ID项有四个数字，第一项*1+第二项*2+第三项*3+第四项*4/4得到一个数字。用SWITCH语句，判断即可。


******************************************************************************/

uint8_t Card_Type1[2];  
uint8_t Card_ID[4]; 
uint8_t Card_KEY[6] = {0xff,0xff,0xff,0xff,0xff,0xff};    //{0x11,0x11,0x11,0x11,0x11,0x11};   //密码
uint8_t Card_Data[16];
uint8_t status;
uint8_t flag;
uint8_t Run_flag=1;
uint8_t Lock_flag=0;
u16 led0pwmval=0;    
u8 dir=1;
uint8_t Err_Count=0;
extern float Angle; 

uint8_t card_number_certification(uint8_t *value);

//从flash中读取各卡信息
void Read_Card(void)
{
	UI0[0]=FLASH_R(FLASH_ADDR1);
	UI0[1]=FLASH_R(FLASH_ADDR1+2);
	UI0[2]=FLASH_R(FLASH_ADDR1+4);
	UI0[3]=FLASH_R(FLASH_ADDR1+6);
	
	UI1[0]=FLASH_R(FLASH_ADDR2);
	UI1[1]=FLASH_R(FLASH_ADDR2+2);
	UI1[2]=FLASH_R(FLASH_ADDR2+4);
	UI1[3]=FLASH_R(FLASH_ADDR2+6);
	
	UI2[0]=FLASH_R(FLASH_ADDR3);
	UI2[1]=FLASH_R(FLASH_ADDR3+2);
	UI2[2]=FLASH_R(FLASH_ADDR3+4);
	UI2[3]=FLASH_R(FLASH_ADDR3+6);
	
	UI3[0]=FLASH_R(FLASH_ADDR4);
	UI3[1]=FLASH_R(FLASH_ADDR4+2);
	UI3[2]=FLASH_R(FLASH_ADDR4+4);
	UI3[3]=FLASH_R(FLASH_ADDR4+6);
}

//查询卡号发送到小程序查看
void upload_card_number(void)
{
	//1.先判断哪个卡号有存入
	
	u8 tempcard0;
	char testbuf[256] = {""};
	char str[256] ={""};
	
	if(UI0[0] == 0xFF && UI0[1] == 0xFF && UI0[2] == 0xFF && UI0[3] == 0xFF) tempcard0 = 0;	//判断系统各卡数据区是否为空，为空才能写入新卡
	else if(UI1[0] == 0xFF && UI1[1] == 0xFF && UI1[2] == 0xFF && UI1[3] == 0xFF) tempcard0 = 1;
	else if(UI2[0] == 0xFF && UI2[1] == 0xFF && UI2[2] == 0xFF && UI2[3] == 0xFF) tempcard0 = 2;
	else if(UI3[0] == 0xFF && UI3[1] == 0xFF && UI3[2] == 0xFF && UI3[3] == 0xFF) tempcard0 = 3;
	else tempcard0 = 4;
	
	if(tempcard0 == 0)
	{
	
		DEBUG_LOG("发布数据 ---无卡-- OneNet_Publish");

		OneNet_Publish(devPubTopic,"{\"Card_Msg\":0,\"value\":0}");
		DEBUG_LOG("==================================================================================");		
		ESP8266_Clear();	
	
	}else{
		sprintf(str,"card1:%d%d%d%d\\rcard2:%d%d%d%d\\rcard3:%d%d%d%d\\rcard4:%d%d%d%d",UI0[0],UI0[1],UI0[2],UI0[3],
		UI1[0],UI1[1],UI1[2],UI1[3],UI2[0],UI2[1],UI2[2],UI2[3],UI3[0],UI3[1],UI3[2],UI3[3]);
		
		sprintf(testbuf,"{\"Card_Msg\":\"%s\",\"value\":1}",str);
		//sprintf(testbuf,"{\"Card_Msg\":\"%s\"}",str);
		DEBUG_LOG("发布数据 ---%s-- OneNet_Publish",testbuf);

		OneNet_Publish(devPubTopic,testbuf);
		DEBUG_LOG("==================================================================================");		
		ESP8266_Clear();		
		DEBUG_LOG("6666");
	}

}

void RC522_Rm_card(void)
{
	
	//1.读取有几张卡
//	u8 tempcard0;
	u8 line = 5;
	u8 Num;
	
 	
	OLED_Clear();
	OLED_ShowString(line,2,"->"); // 5 6 7 8 
	OLED_ShowString(5,4,"   Card 1 ");
	OLED_ShowString(6,4,"   Card 2 ");
	OLED_ShowString(7,4,"   Card 3 ");
	OLED_ShowString(8,4,"   Card 4 ");		
	
	while(1)
	{
		Num = Key_GetNum();
		
		if(Num == 1)
		{
				OLED_Clear();
				if(line <= 5)
				{
					line = 8;
				}else{
					line --;
				}
				OLED_Clear();
				OLED_ShowString(line,2,"->"); // 5 6 7 8 
				OLED_ShowString(5,4,"   Card 1 ");
				OLED_ShowString(6,4,"   Card 2 ");
				OLED_ShowString(7,4,"   Card 3 ");
				OLED_ShowString(8,4,"   Card 4 ");		
			
		
		}else if(Num == 2)
		{
				if(line >= 8)
				{
					line = 5;
				}else{
					line ++;
				}
		
				OLED_Clear();
				OLED_ShowString(line,2,"->"); // 5 6 7 8 
				OLED_ShowString(5,4,"   Card 1 ");
				OLED_ShowString(6,4,"   Card 2 ");
				OLED_ShowString(7,4,"   Card 3 ");
				OLED_ShowString(8,4,"   Card 4 ");		
		
		}else if(Num == 3)
		{
			if(line==5)	//删除卡1
			{
				OLED_Clear();
				OLED_ShowString(2,1,"Clear Card 1 OK ");
				delay_ms(1500);
				FLASH_Clear(FLASH_ADDR1);	
				UI0[0]=0xFF;
				UI0[1]=0xFF;
				UI0[2]=0xFF;
				UI0[3]=0xFF;
				delay_ms(1500);
				OLED_Clear();
				return;
			}

			
			if(line==6)
			{
				OLED_Clear();
				OLED_ShowString(2,1,"Clear Card 2 OK ");
				delay_ms(1500);
				FLASH_Clear(FLASH_ADDR2);
				UI1[0]=0xFF;
				UI1[1]=0xFF;
				UI1[2]=0xFF;
				UI1[3]=0xFF;
		
				OLED_Clear();
				return;
			}
		
			if(line==7)
			{
				OLED_Clear();
				OLED_ShowString(2,1,"Clear Card 3 OK ");
				delay_ms(1500);
				FLASH_Clear(FLASH_ADDR3);
				UI2[0]=0xFF;
				UI2[1]=0xFF;
				UI2[2]=0xFF;
				UI2[3]=0xFF;
				OLED_Clear();
				return;				
			}

			
			if(line==8)
			{
				OLED_Clear();
				OLED_ShowString(2,1,"Clear Card 4 OK ");
				delay_ms(1500);
				FLASH_Clear(FLASH_ADDR4);
				UI3[0]=0xFF;
				UI3[1]=0xFF;
				UI3[2]=0xFF;
				UI3[3]=0xFF;
			
				OLED_Clear();
				return;				
			}		
			

		}		
			
 	
	}



}

void RC522_Add_card(void)
{
	OLED_Clear();
	OLED_WriteCN(5,2,6,5);		
	while(1)
	{
		
		if(MI_OK==PcdRequest(0x52, Card_Type1))  //寻卡函数，如果成功返回MI_OK  打印多次卡号
		{
				OLED_Clear();
				OLED_WriteCN(6,2,5,5);	
				delay_ms(300);
				OLED_ShowChar(6,12,'.');
				delay_ms(300);
				OLED_ShowChar(6,13,'.');
				delay_ms(300);
				OLED_ShowChar(6,14,'.');
				delay_ms(300);
				OLED_ShowChar(6,15,'.');
			break;
		}
	
