Abear6666/stm32lock/code/stm32code/Hardware/RC522.c
	}
			
			

			uint16_t cardType = (Card_Type1[0]<<8)|Card_Type1[1];//读不同卡的类型
			DEBUG_LOG("卡类型：(0x%04X)\r\n",cardType);  //"Card Type(0x%04X):"
			
			switch(cardType)
				{
					case 0x4400:
							DEBUG_LOG("Mifare UltraLight\r\n");
							break;
					case 0x0400:
							DEBUG_LOG("Mifare One(S50)\r\n");
							break;
					case 0x0200:
							DEBUG_LOG("Mifare One(S70)\r\n");
							break;
					case 0x0800:
							DEBUG_LOG("Mifare Pro(X)\r\n");
							break;
					case 0x4403:
							DEBUG_LOG("Mifare DESFire\r\n");
							break;
					default:
							DEBUG_LOG("Unknown Card\r\n");
							break;
			}
			status = PcdAnticoll(Card_ID);//防冲撞 如果成功返回MI_OK
			if(status != MI_OK)
				{
					DEBUG_LOG("Anticoll Error\r\n");
				}else
				{
					DEBUG_LOG("Serial Number:%d %d %d %d\r\n",Card_ID[0],Card_ID[1],Card_ID[2],Card_ID[3]);
					
					DEBUG_LOG("card0 Number:%d %d %d %d\r\n",UI0[0],UI0[1],UI0[2],UI0[3]);
					DEBUG_LOG("card0 Number:%d %d %d %d\r\n",UI1[0],UI1[1],UI1[2],UI1[3]);
					DEBUG_LOG("card0 Number:%d %d %d %d\r\n",UI2[0],UI2[1],UI2[2],UI2[3]);
					DEBUG_LOG("card0 Number:%d %d %d %d\r\n",UI3[0],UI3[1],UI3[2],UI3[3]);

					if(UI0[0] == 0xFF && UI0[1] == 0xFF && UI0[2] == 0xFF && UI0[3] == 0xFF) tempcard = 0;	//判断系统各卡数据区是否为空，为空才能写入新卡
					else if(UI1[0] == 0xFF && UI1[1] == 0xFF && UI1[2] == 0xFF && UI1[3] == 0xFF) tempcard = 1;
					else if(UI2[0] == 0xFF && UI2[1] == 0xFF && UI2[2] == 0xFF && UI2[3] == 0xFF) tempcard = 2;
					else if(UI3[0] == 0xFF && UI3[1] == 0xFF && UI3[2] == 0xFF && UI3[3] == 0xFF) tempcard = 3;
					else tempcard = 4;
					
					if(Card_ID[0]==UI0[0] && Card_ID[1]==UI0[1] && Card_ID[2]==UI0[2] && Card_ID[3]==UI0[3])	//判断新卡是否已经录入
					{
						tempcard = 5;
					}
					if(Card_ID[0]==UI1[0] && Card_ID[1]==UI1[1] && Card_ID[2]==UI1[2] && Card_ID[3]==UI1[3])
					{
						tempcard = 5;
					}
					if(Card_ID[0]==UI2[0] && Card_ID[1]==UI2[1] && Card_ID[2]==UI2[2] && Card_ID[3]==UI2[3])
					{
						tempcard = 5;
					}
					if(Card_ID[0]==UI3[0] && Card_ID[1]==UI3[1] && Card_ID[2]==UI3[2] && Card_ID[3]==UI3[3])
					{
						tempcard = 5;
					}
					
					DEBUG_LOG("----%d",tempcard);
					OLED_Clear();
					
					switch(tempcard)
					{
						
						case 0:
						{
							UI0[0] = Card_ID[0];	//将新卡数据写入UI0[]数组
							UI0[1] = Card_ID[1];
							UI0[2] = Card_ID[2];
							UI0[3] = Card_ID[3];
							FLASH_W(FLASH_ADDR1,UI0[0],UI0[1],UI0[2],UI0[3]);	//将新卡数据存入flash
							OLED_ShowString(1,1,"  Add Card 1 OK ");	//写卡成功，蜂鸣器响一声
							DEBUG_LOG("Add Card 1 OK");
							delay_ms(1000);
							
							//WaitCardOff();	//等待卡片移走
						}break;
						case 1:
						{
							UI1[0] = Card_ID[0];
							UI1[1] = Card_ID[1];
							UI1[2] = Card_ID[2];
							UI1[3] = Card_ID[3];
							FLASH_W(FLASH_ADDR2,UI1[0],UI1[1],UI1[2],UI1[3]);
							OLED_ShowString(1,1,"  Add Card 2 OK ");
							DEBUG_LOG("Add Card 2 OK");
							delay_ms(1000);
							//WaitCardOff();
						}break;
						case 2:
						{
							UI2[0] = Card_ID[0];
							UI2[1] = Card_ID[1];
							UI2[2] = Card_ID[2];
							UI2[3] = Card_ID[3];
							FLASH_W(FLASH_ADDR3,UI2[0],UI2[1],UI2[2],UI2[3]);
							OLED_ShowString(1,1,"  Add Card 3 OK ");
							DEBUG_LOG("Add Card 3 OK");
							delay_ms(1000);
							//WaitCardOff();
						}break;
						case 3:
						{
							UI3[0] = Card_ID[0];
							UI3[1] = Card_ID[1];
							UI3[2] = Card_ID[2];
							UI3[3] = Card_ID[3];
							FLASH_W(FLASH_ADDR4,UI3[0],UI3[1],UI3[2],UI3[3]);
							OLED_ShowString(1,1,"  Add Card 4 OK ");
							DEBUG_LOG("Add Card 4 OK");
							delay_ms(1000);
							//WaitCardOff();
						}break;
						case 4:
						{	
							OLED_ShowString(1,1,"   NO memory    ");	//若4个存卡数组均已存入卡片则显示无数据空间，蜂鸣器发出警报
							DEBUG_LOG("NO memory");
							delay_ms(1000);
							//WaitCardOff();
						}
						case 5:
						{	
							OLED_ShowString(1,1," Existing Card! ");	//若新卡已录入，蜂鸣器发出警报
							DEBUG_LOG(" Existing Card!");
							delay_ms(1000);

						

						}break;
						default:break;
					 }
					
					


				}
			
			status = PcdSelect(Card_ID);  //选卡 如果成功返回MI_OK
			if(status != MI_OK){
					DEBUG_LOG("Select Card Error\r\n");
			}
			else{
				DEBUG_LOG("Select Card OK\r\n");
				
			}
			
			
			status = PcdHalt();  //卡片进入休眠状态
			if(status != MI_OK){
					DEBUG_LOG("PcdHalt Error\r\n");			
			}
			else
			{
					DEBUG_LOG("PcdHalt OK\r\n");	
			}

			


		DEBUG_LOG("cesss444");

	//delay_ms(500);
	//PcdAntennaOff();  //关闭天线

}




void RC522_Get_card(void)
{
								char buf[25] = {""};
//	while(Run_flag)
//	{
	
		if(MI_OK==PcdRequest(0x52, Card_Type1))  //寻卡函数，如果成功返回MI_OK  打印多次卡号
		{
			
				OLED_Clear();
				OLED_WriteCN(6,2,5,5);	
				delay_ms(500);
				OLED_ShowChar(6,12,'.');
				delay_ms(500);
				OLED_ShowChar(6,13,'.');
				delay_ms(500);
				OLED_ShowChar(6,14,'.');
				delay_ms(500);
				OLED_ShowChar(6,15,'.');
			

			uint16_t cardType = (Card_Type1[0]<<8)|Card_Type1[1];//读不同卡的类型
			DEBUG_LOG("卡类型：(0x%04X)\r\n",cardType);  //"Card Type(0x%04X):"
			
			switch(cardType)
				{
					case 0x4400:
							DEBUG_LOG("Mifare UltraLight\r\n");
							break;
					case 0x0400:
							DEBUG_LOG("Mifare One(S50)\r\n");
							break;
					case 0x0200:
							DEBUG_LOG("Mifare One(S70)\r\n");
							break;
					case 0x0800:
							DEBUG_LOG("Mifare Pro(X)\r\n");
							break;
					case 0x4403:
							DEBUG_LOG("Mifare DESFire\r\n");
							break;
					default:
							DEBUG_LOG("Unknown Card\r\n");
							break;
			}
			status = PcdAnticoll(Card_ID);//防冲撞 如果成功返回MI_OK
			if(status != MI_OK)
				{
					DEBUG_LOG("Anticoll Error\r\n");
				}else
				{
					DEBUG_LOG("Serial Number:%d %d %d %d\r\n",Card_ID[0],Card_ID[1],Card_ID[2],Card_ID[3]);
						flag=card_number_certification(Card_ID);
					
					
						DEBUG_LOG("flag=%d \r\n",flag);
						if(flag != 0)//解锁
						{
							
							unlock_interface();
										
						
						}else{
						
							Fail_Num++; // 门禁解锁错误次数
		
							//判断标志 才进行错误次数增加减少
							sprintf(buf,"fail num: %d",Fail_Num);
							OLED_ShowString(2,1,buf);
								delay_ms(500);
								OLED_Clear();
						}

